<?php
// +----------------------------------------------------------------------
// | Created by PhpStorm.
// +----------------------------------------------------------------------
// | user : 放下
// +----------------------------------------------------------------------
// | blog : www.putyy.com
// +----------------------------------------------------------------------
// | email: 10945014@qq.com
// +----------------------------------------------------------------------
// | Date : 2019/8/1 13:51
// +----------------------------------------------------------------------


namespace WGCYunPay\Data\Authentication;

use WGCYunPay\Data\Authentication\BaseData;
use WGCYunPay\Data\Router;

class UserWhiteData extends BaseData
{
    protected $route = Router::USER_WHITE_CHECK;
}
