<?php
// +----------------------------------------------------------------------
// | Created by PhpStorm.
// +----------------------------------------------------------------------
// | user : 放下
// +----------------------------------------------------------------------
// | blog : www.putyy.com
// +----------------------------------------------------------------------
// | email: 10945014@qq.com
// +----------------------------------------------------------------------
// | Date : 2019/7/31 11:19
// +----------------------------------------------------------------------


namespace WGCYunPay\Data\Pay;

use WGCYunPay\Data\Pay\WxPayData;
use WGCYunPay\Data\Router;

class WxRedPayData extends WxPayData
{
    /**
     * 微信打款模式(选填，⼆种取值，可填 "", "redpacket")
     * @var string
     */
    public $wxpay_mode = "";

    protected $route = Router::WX_PAY;
}
