<?php
// +----------------------------------------------------------------------
// | Created by PhpStorm.
// +----------------------------------------------------------------------
// | user : 放下
// +----------------------------------------------------------------------
// | blog : www.putyy.com
// +----------------------------------------------------------------------
// | email: 10945014@qq.com
// +----------------------------------------------------------------------
// | Date : 2019/7/31 16:02
// +----------------------------------------------------------------------
$config = new \WGCYunPay\Config();
$config->dealer_id  = '';
$config->broker_id  = '';
$config->app_key    = '';
$config->des3_key   = '';
$config->mess       = \WGCYunPay\Util\StringUtil::round(10);
$config->timestamp  = time();
$config->request_id = \WGCYunPay\Util\StringUtil::round(10);
return $config;
